src/Catalogs/кфкБрокеры/кфкБрокеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкБрокеры</name>
  <attributes>
    <name>БлокироватьПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьЧтение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПодключения</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимПароля</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкБрокеры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает доступные брокеры.
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - Доступные брокеры:
//	 * Ключ - СправочникСсылка.кфкБрокеры - Брокер
//	 * Значение см. ПустоеОписаниеБрокера
//
Функция ДоступныеБрокеры() Экспорт
	
	Результат = Новый Соответствие; // Соответствие Из Структура
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Брокеры.Ссылка,
	|	Брокеры.Наименование
	|ИЗ
	|	Справочник.кфкБрокеры КАК Брокеры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	кфкБрокерыУзлы.Ссылка,
	|	кфкБрокерыУзлы.Адрес
	|ИЗ
	|	Справочник.кфкБрокеры.Узлы КАК кфкБрокерыУзлы
	|ГДЕ
	|	кфкБрокерыУзлы.Использование = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БрокерыПараметрыПодключения.Ссылка,
	|	БрокерыПараметрыПодключения.Ключ,
	|	БрокерыПараметрыПодключения.Значение
	|ИЗ
	|	Справочник.кфкБрокеры.ПараметрыПодключения КАК БрокерыПараметрыПодключения
	|ГДЕ
	|	БрокерыПараметрыПодключения.РежимПароля = ЛОЖЬ";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	ВыборкаУзлы = РезультатЗапроса[1].Выбрать();
	ВыборкаПараметры = РезультатЗапроса[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Описание = ПустоеОписаниеБрокера();
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		
		// Узлы
		Узлы = Новый Массив;
		ВыборкаУзлы.Сбросить();
		Пока ВыборкаУзлы.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
			Узлы.Добавить(ВыборкаУзлы.Адрес);
		КонецЦикла;
		Описание.АдресБрокера = СтрСоединить(Узлы, ",");
		
		// Параметры подключения
		ВыборкаПараметры.Сбросить();
		Пока ВыборкаПараметры.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
			Описание.ПараметрыПодключения.Вставить(ВыборкаПараметры.Ключ, ВыборкаПараметры.Значение);
		КонецЦикла;
		
		ДанныеИзБХ = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Выборка.Ссылка, "ПараметрыПодключения");
		Если Не ДанныеИзБХ = Неопределено Тогда
			Для Каждого КлючЗначение Из ДанныеИзБХ Цикл
				Описание.ПараметрыПодключения.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
		КонецЕсли;
		
		Результат.Вставить(Описание.Ссылка, Описание);
		
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пустое описание брокера.
// 
// Возвращаемое значение:
//	Структура - Пустое описание брокера:
//	 * Ссылка - СправочникСсылка.кфкБрокеры - Брокер
//	 * Наименование - Строка - Наименование брокера
//	 * АдресБрокера - Строка - Адрес брокера
//	 * ПараметрыПодключения - Соответствие Из КлючИЗначение - Параметры подключения:
//		** Ключ - Строка - Имя параметра
//		** Значение - Произвольный - Значение параметра
Функция ПустоеОписаниеБрокера()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("Наименование", "");
	Результат.Вставить("АдресБрокера", "");
	Результат.Вставить("ПараметрыПодключения", Новый Соответствие);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли
